create table Regions (
    id serial not null primary key,
    name varchar(255) unique not null
);

insert into Regions (name) values
('Москва'),
('Санкт-Петербург'),
('Республика Адыгея'),
('Республика Башкортостан'),
('Республика Бурятия'),
('Республика Алтай'),
('Республика Дагестан'),
('Республика Ингушетия'),
('Кабардино-Балкарская Республика'),
('Республика Калмыкия'),
('Камчатский край'),
('Республика Карелия'),
('Республика Коми'),
('Костромская область'),
('Краснодарский край'),
('Красноярский край'),
('Курганская область'),
('Курская область'),
('Ленинградская область'),
('Липецкая область'),
('Магаданская область'),
('Московская область'),
('Мурманская область'),
('Нижегородская область'),
('Новгородская область'),
('Новосибирская область'),
('Омская область'),
('Оренбургская область'),
('Орловская область'),
('Пензенская область'),
('Пермский край'),
('Приморский край'),
('Псковская область'),
('Ростовская область'),
('Рязанская область'),
('Самарская область'),
('Саратовская область'),
('Сахалинская область'),
('Свердловская область'),
('Смоленская область'),
('Ставропольский край'),
('Тамбовская область'),
('Тверская область'),
('Томская область'),
('Тульская область'),
('Тюменская область'),
('Ульяновская область'),
('Удмуртская Республика'),
('Хабаровский край'),
('Ханты-Мансийский автономный округ'),
('Челябинская область'),
('Чеченская Республика'),
('Чувашская Республика'),
('Ярославская область'),
('Ямало-Ненецкий автономный округ');

create table Status (
    id serial not null primary key,
    name text unique not null, 
);

insert into Status (name) values
('Связь c оператором'),
('Формирование'),
('В пути'), 
('Принят');

create table Users (
    id bigserial not null primary key,
    name text not null,
    email text unique not null, 
    phone_number varchar(11),
    region_id integer references Region (id)
);

create table Goods (
    id serial not null primary key,
    name text not null,
    count integer not null check(count >= 0)
);

create table Orders (
    user_id integer not null references Users (id),
    good integer not null references Goods (id),
    count integer not null,
    status integer not null references Status (id)
);